## Plan Result (@infrastructure/transactional-emails-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/13297941565)



<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_sns_topic_subscription.ListEvents-sns-subscription
* Update
  * aws_sqs_queue_policy.transactional-email-sns-dlq-policy
  * aws_sqs_queue_policy.transactional-email-sns-sqs-policy



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.ListEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ListEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy                   = jsonencode(
            {
              + detail-type = [
                  + "list-export-requested",
                ]
            }
        )
      + filter_policy_scope             = "MessageBody"
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEvents"
    }

  # aws_sqs_queue_policy.transactional-email-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (4 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReadyEvents",
                                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.transactional-email-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (4 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReadyEvents",
                                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>







## :warning: Errors

* add a label @infrastructure/transactional-emails-production/add-or-update: POST https://api.github.com/repos/Pocket/pocket-monorepo/issues/1041/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]


<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":1041,"Program":"tfcmt","SHA1":"709896f3073e5c2c6e8ef2d3aaf00295f48ed05e","Target":"@infrastructure/transactional-emails-production","Vars":{},"WorkflowName":"Transactional Emails"} -->